In [1]:
import numpy as np
import pandas as pd

In [3]:
q1_dict1 = {
    'A':'a',
    'B':'b',
    'C':'c',
    'D':'d',
    'E':'e'
}

q1_dict2 = {
    'A':1,
    'B':2,
    'C':3,
    'D':4,
    'E':5
}

q1_series = pd.Series(q1_dict1, q1_dict2)

q1 = pd.DataFrame({
    'lowercase':q1_dict1,
    'numbers':q1_dict2
})

  lowercase  numbers
A         a        1
B         b        2
C         c        3
D         d        4
E         e        5

In [20]:
Q1 = q1.loc['C','numbers']

In [18]:
Q2 = q1[1:5]

  lowercase  numbers
B         b        2
C         c        3
D         d        4
E         e        5

In [21]:
Q3 = q1.loc['D']

lowercase    d
numbers      4
Name: D, dtype: object

In [50]:
Q4 = q1.loc['A':'C','numbers']

A    1
B    2
C    3
Name: numbers, dtype: int64

In [29]:
Q5 = q1.loc[['A','C','D']]

  lowercase  numbers
A         a        1
C         c        3
D         d        4

In [32]:
Q6 = q1.loc['C']

lowercase    c
numbers      3
Name: C, dtype: object

In [33]:
Q7 = q1.loc['E','numbers']

5

In [34]:
Q8 = q1.loc['C':'E']

  lowercase  numbers
C         c        3
D         d        4
E         e        5

In [38]:
# Using .loc, obtain the rows from q1 with numbers less than three.  Assign it to Q9.

Q9 = q1.loc[q1['numbers'] < 3]

  lowercase  numbers
A         a        1
B         b        2

In [39]:
Q10 = q1.loc['D']

lowercase    d
numbers      4
Name: D, dtype: object

In [40]:
Q11 = q1.loc['E','numbers']

5

In [41]:
Q12 = q1.loc[['A','C','D']]

  lowercase  numbers
A         a        1
C         c        3
D         d        4

In [48]:
Q13 = q1.loc[['C','D','E']]

In [49]:
Q14 = q1['lowercase']

A    a
B    b
C    c
D    d
E    e
Name: lowercase, dtype: object

In [51]:
Q15 = pd.DataFrame({
    'lowercase':q1_dict1,
    'numbers':q1_dict2
})

  lowercase  numbers
A         a        1
B         b        2
C         c        3
D         d        4
E         e        5

In [60]:
# Index Q15 to add an additional column to the dataframe called “percent”, 
# that takes each number and divides it by the sum of all the numbers. 

num_sum = sum(Q15['numbers'])

Q15['percent'] = Q15['numbers'] / num_sum

  lowercase  numbers   percent
A         a        1  0.066667
B         b        2  0.133333
C         c        3  0.200000
D         d        4  0.266667
E         e        5  0.333333